#01212019 [01-21-2019]


set_clock_groups -name asynchronous -asynchronous -group [get_clocks [get_clocks -of_objects [get_pins zynq_soc_i/CLK_GEN_148MHZ/inst/mmcm_adv_inst/CLKOUT0]]] -group [get_clocks *clk_fpga*]
create_generated_clock -name io_hdmio_clk -source [get_pins zynq_soc_i/HDMI_OUTPUT/HDMI/U0/V6_GEN.ODDR_hdmi_clk_o/C] -divide_by 1 -invert [get_ports io_hdmio_clk]
set_false_path -from [get_ports *pixclk*]
set_false_path -from [get_clocks clk_fpga_2] -to [get_clocks clk_fpga_0]

# HSV HSL
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/maxValue_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueTop_reg[*]/D}] 12.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/maxValue_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueTop_reg[*]/D}] 12.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/uFs3Rgb_reg[blue][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueTop_reg[*]/D}] 13.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/uFs3Rgb_reg[green][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueTop_reg[*]/D}] 13.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/uFs3Rgb_reg[red][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueTop_reg[*]/D}] 13.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/uFs3Rgb_reg[blue][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueTop_reg[*]/D}] 13.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/uFs3Rgb_reg[green][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueTop_reg[*]/D}] 13.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/uFs3Rgb_reg[green][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueTop_reg[*]/D}] 13.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/uFs3Rgb_reg[red][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueTop_reg[*]/D}] 13.000

set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueTop_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueBot_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/satUfTop_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/satValueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/satUfBott_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/satValueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueTop_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueBot_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/satUfTop_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/satValueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/satUfBott_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/satValueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueTop_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueBot_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/satUfTop_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/satValueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/satUfBott_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/satValueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueTop_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueBot_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/satUfTop_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/satValueQuot_reg[*]/D}] 61.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/satUfBott_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/HSL_FRAME_ENABLE.hslInst/satValueQuot_reg[*]/D}] 61.000


set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/CoefMultInst/FloatMultiplyTopFractLevelInst/FloatMultiplyInst/U0/i_synth/MULT.OP/OP/RESULT_REG.NORMAL.mant_op_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/CoefMultInst/FloatMultiplyTopK9Inst/FloatMultiplyInst/U0/i_synth/MULT.OP/MULT/MULT_GEN_VARIANT.FIX_MULT/MULT/gDSP.gDSP_only.iDSP/use_prim.appDSP48[0].bppDSP48[0].use_dsp.use_dsp48e1.iDSP48E1/B[*]}] 13.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/CoefMultInst/FloatMultiplyTopFractLevelInst/FloatMultiplyInst/U0/i_synth/MULT.OP/OP/RESULT_REG.NORMAL.mant_op_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/ImageKernelInst/CoefMultInst/FloatMultiplyTopK9Inst/FloatMultiplyInst/U0/i_synth/MULT.OP/MULT/MULT_GEN_VARIANT.FIX_MULT/MULT/gDSP.gDSP_only.iDSP/use_prim.appDSP48[0].bppDSP48[0].use_dsp.use_dsp48e1.iDSP48E1/B[*]}] 13.000

set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/AxisExternalInst/vfpConfigInst/wrRegsOut_reg[cfigReg5][15]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/videoSelectInst/channels_reg[red][*]/D}] 10.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/AxisExternalInst/vfpConfigInst/wrRegsOut_reg[cfigReg5][11]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/videoSelectInst/channels_reg[blue][*]/D}] 10.000
set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/AxisExternalInst/vfpConfigInst/wrRegsOut_reg[cfigReg5][13]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/videoSelectInst/channels_reg[green][*]/D}] 10.000

##FROM HSL_FRAME_ENABLE TO
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueBot_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueQuot_reg[*]/D}] 61.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueTop_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueQuot_reg[*]/D}] 61.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSL_FRAME_ENABLE.hslInst/satUfBott_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSL_FRAME_ENABLE.hslInst/satValueQuot_reg[*]/D}] 61.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSL_FRAME_ENABLE.hslInst/satUfTop_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSL_FRAME_ENABLE.hslInst/satValueQuot_reg[*]/D}] 61.000
##FROM HSV_FRAME_ENABLE TO
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/satUfBott_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/satValueQuot_reg[*]/D}] 61.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/satUfTop_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/satValueQuot_reg[*]/D}] 61.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueBot_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueQuot_reg[*]/D}] 61.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueTop_reg[*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueQuot_reg[*]/D}] 61.000
##FROM HSV_FRAME_ENABLE RGB TO HSL_FRAME_ENABLE
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/uFs3Rgb_reg[red][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueTop_reg[*]/D}] 14.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/uFs3Rgb_reg[green][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueTop_reg[*]/D}] 14.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/uFs3Rgb_reg[blue][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSL_FRAME_ENABLE.hslInst/hueTop_reg[*]/D}] 14.000

##FROM HSV_FRAME_ENABLE RGB TO HSV_FRAME_ENABLE
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/uFs3Rgb_reg[red][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueTop_reg[*]/D}] 14.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/uFs3Rgb_reg[green][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueTop_reg[*]/D}] 14.000
#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/uFs3Rgb_reg[blue][*]/C}] -to [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/FiltersInst/CGA_TO_FILTRS1_FRAME_ENABLE.ImageKernelInst/HSV_FRAME_ENABLE.hsvInst/hueTop_reg[*]/D}] 14.000



#set_max_delay -from [get_pins {zynq_soc_i/PS_VIDEO/D5M/VFP/U0/VideoStreamInst/frameProcessInst/syncxy_reg[y][*]__0/C}] -to [get_pins zynq_soc_i/PS_VIDEO/D5M/VFP/videoSelectInst/TextGenYcbcrInst/textElement2/FontRomInst/fontRow_reg/ENARDEN] 10.000


